#pragma once
#include <string>

using namespace std;


const int CODE_ERROR = -1;

const string TREE_METHODS[]
{
    "1) Печать бинарного дерева в форме дерева",
    "2) Обход в ширину",
    "3) Центрированный (симметричный) обход",
    "4) Обход в прямом порядке",
    "5) Обход в обратном порядке",
    "6) Определить количество элементов",
    "7) Определить максимальную высоту",
    "8) Поиск выбранного элемента",
    "9) Поиск минимального элемента",
    "10) Поиск максимального элемента",
    "11) Поиск следующего элемента",
    "12) Поиск предыдущего элемента",
    "13) Вставка выбранного элемента",
    "14) Удаление выбранного элемента",
    "15) Удаление всех элементов"
};
