#pragma once
#include <string>

using namespace std;


const int CODE_ERROR = -1;

const string TREE_METHODS[]
{
    "1) Печать бинарного дерева в форме дерева",
    "2) Центрированный (симметричный) обход",
    "3) Обход в прямом порядке",
    "4) Обход в обратном порядке",
    "5) Определить количество элементов",
    "6) Определить максимальную высоту",
    "7) Поиск выбранного элемента",
    "8) Поиск минимального элемента",
    "9) Поиск максимального элемента",
    "10) Поиск следующего элемента",
    "11) Поиск предыдущего элемента",
    "12) Вставка выбранного элемента",
    "13) Удаление выбранного элемента",
    "14) Удаление всех элементов"
};

const string DATA_OPTIONS[]
{
    "Заполнение дерева отсортированными данными",
    "Заполнение дерева случайными данными",
};

const string TEST_METHODS[]
{
    "insert",
    "delElem"
};